lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf54h20_enga_application</name>
  <series>nRF54h</series>
  <version>1</version>
  <description>nRF54H20_EngA reference description for system-on-chip with many ARM 32-bit Cortex-M33 microcontrollers</description>
  <licenseText>
Copyright (c) 2010 - 2024, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <cpu>
    <name>CM33</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
    <deviceNumInterrupts>480</deviceNumInterrupts>
    <sauNumRegions>4</sauNumRegions>
  </cpu>
  <headerSystemFilename>system_nrf54h20_enga_application</headerSystemFilename>
  <vendorExtensions>
    <MaxInterrupts>480</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>UICR_NS</name>
      <description>User information configuration registers</description>
      <baseAddress>0x0FFF8000</baseAddress>
      <headerStructName>UICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>MEM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>UICR_MEM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Memory configuration of the memory region</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>READ</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Read access to MEM[n] is not allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Read access to MEM[n] is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Write access to MEM[n] is not allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Write access to MEM[n] is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EXECUTE</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>SW execution from MEM[n] is not allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>SW execution from MEM[n] is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECURE</name>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Non-secure access to MEM[n] is not allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Non-secure access to MEM[n] is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NSC</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Memory region is not non-secure callable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Memory region is non-secure callable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OWNERID</name>
                <description>Memory owner identification</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ADDRESS</name>
                <description>Memory region start address, bits [31:12]</description>
                <lsb>12</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster: Size of the memory region</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Memory size in bytes</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>192</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>PERIPH[%s]</name>
          <description>Unspecified</description>
          <headerStructName>UICR_PERIPH</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Peripheral configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SECURE</name>
                <description>Peripheral security mapping</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Peripheral is mapped in secure peripheral address space</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Peripheral is mapped in non-secure peripheral address space.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMASEC</name>
                <description>Security attribution for the DMA transfer</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>DMA transfers initiated by this peripheral have the secure attribute set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>DMA transfers initiated by this peripheral have the non-secure attribute set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PROCESSOR</name>
                <description>Processor ID of the processor that will receive the peripheral IRQ</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ADDRESS</name>
                <description>Peripheral address, bits [31:12]</description>
                <lsb>12</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x00C</dimIncrement>
          <name>GPIOTE[%s]</name>
          <description>Unspecified</description>
          <headerStructName>UICR_GPIOTE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x480</addressOffset>
          <register>
            <name>INSTANCE</name>
            <description>Description cluster: Address of the GPIOTE instance associated with GPIOTE[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Instance address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
