lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
                        <description>Own the channel 23</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_24</name>
                    <description>Channel number</description>
                    <lsb>24</lsb>
                    <msb>24</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 24</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 24</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_25</name>
                    <description>Channel number</description>
                    <lsb>25</lsb>
                    <msb>25</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 25</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 25</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_26</name>
                    <description>Channel number</description>
                    <lsb>26</lsb>
                    <msb>26</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 26</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 26</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_27</name>
                    <description>Channel number</description>
                    <lsb>27</lsb>
                    <msb>27</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 27</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 27</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_28</name>
                    <description>Channel number</description>
                    <lsb>28</lsb>
                    <msb>28</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 28</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 28</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_29</name>
                    <description>Channel number</description>
                    <lsb>29</lsb>
                    <msb>29</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 29</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 29</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_30</name>
                    <description>Channel number</description>
                    <lsb>30</lsb>
                    <msb>30</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 30</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 30</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_31</name>
                    <description>Channel number</description>
                    <lsb>31</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 31</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 31</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
