lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 24 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 24 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_25</name>
                      <description>Link direction</description>
                      <lsb>25</lsb>
                      <msb>25</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 25 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 25 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_26</name>
                      <description>Link direction</description>
                      <lsb>26</lsb>
                      <msb>26</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 26 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 26 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_27</name>
                      <description>Link direction</description>
                      <lsb>27</lsb>
                      <msb>27</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 27 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 27 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_28</name>
                      <description>Link direction</description>
                      <lsb>28</lsb>
                      <msb>28</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 28 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 28 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_29</name>
                      <description>Link direction</description>
                      <lsb>29</lsb>
                      <msb>29</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 29 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 29 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_30</name>
                      <description>Link direction</description>
                      <lsb>30</lsb>
                      <msb>30</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 30 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 30 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_31</name>
                      <description>Link direction</description>
                      <lsb>31</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 31 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 31 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
