lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_28</name>
                      <description>Link enable</description>
                      <lsb>28</lsb>
                      <msb>28</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 28 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 28 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_29</name>
                      <description>Link enable</description>
                      <lsb>29</lsb>
                      <msb>29</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 29 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 29 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_30</name>
                      <description>Link enable</description>
                      <lsb>30</lsb>
                      <msb>30</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 30 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 30 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_31</name>
                      <description>Link enable</description>
                      <lsb>31</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>The channel 31 is disabled</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>The channel 31 is enabled</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>CHG</name>
              <description>Unspecified</description>
              <headerStructName>UICR_DPPI_GLOBAL_CHG</headerStructName>
              <access>read-write</access>
              <addressOffset>0x014</addressOffset>
              <register>
                <name>OWN</name>
                <description>Description cluster: Request ownership of the channel groups of DPPI[n] in Global domain</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>CHG_0</name>
                    <description>Channel group number</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 0</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 0</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_1</name>
                    <description>Channel group number</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 1</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 1</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_2</name>
                    <description>Channel group number</description>
                    <lsb>2</lsb>
                    <msb>2</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 2</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 2</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_3</name>
                    <description>Channel group number</description>
                    <lsb>3</lsb>
                    <msb>3</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 3</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 3</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_4</name>
                    <description>Channel group number</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 4</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 4</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_5</name>
                    <description>Channel group number</description>
                    <lsb>5</lsb>
                    <msb>5</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 5</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 5</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_6</name>
                    <description>Channel group number</description>
                    <lsb>6</lsb>
                    <msb>6</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 6</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 6</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_7</name>
                    <description>Channel group number</description>
                    <lsb>7</lsb>
                    <msb>7</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 7</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 7</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_8</name>
                    <description>Channel group number</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 8</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 8</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_9</name>
                    <description>Channel group number</description>
                    <lsb>9</lsb>
                    <msb>9</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 9</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 9</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_10</name>
                    <description>Channel group number</description>
                    <lsb>10</lsb>
                    <msb>10</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 10</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 10</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_11</name>
                    <description>Channel group number</description>
                    <lsb>11</lsb>
                    <msb>11</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 11</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 11</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_12</name>
                    <description>Channel group number</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 12</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 12</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_13</name>
                    <description>Channel group number</description>
                    <lsb>13</lsb>
                    <msb>13</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 13</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 13</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_14</name>
                    <description>Channel group number</description>
                    <lsb>14</lsb>
                    <msb>14</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 14</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 14</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_15</name>
                    <description>Channel group number</description>
                    <lsb>15</lsb>
                    <msb>15</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 15</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 15</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_16</name>
                    <description>Channel group number</description>
                    <lsb>16</lsb>
                    <msb>16</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 16</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 16</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_17</name>
                    <description>Channel group number</description>
                    <lsb>17</lsb>
                    <msb>17</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 17</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 17</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_18</name>
                    <description>Channel group number</description>
                    <lsb>18</lsb>
                    <msb>18</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 18</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 18</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_19</name>
                    <description>Channel group number</description>
                    <lsb>19</lsb>
                    <msb>19</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 19</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 19</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_20</name>
                    <description>Channel group number</description>
                    <lsb>20</lsb>
                    <msb>20</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 20</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 20</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_21</name>
                    <description>Channel group number</description>
                    <lsb>21</lsb>
                    <msb>21</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 21</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 21</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_22</name>
                    <description>Channel group number</description>
                    <lsb>22</lsb>
                    <msb>22</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 22</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 22</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_23</name>
                    <description>Channel group number</description>
                    <lsb>23</lsb>
                    <msb>23</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel group 23</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel group 23</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_24</name>
                    <description>Channel group number</description>
