lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
        <cluster>
          <name>LFOSC</name>
          <description>Unspecified</description>
          <headerStructName>BICR_LFOSC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x014</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>LF oscillator configuration.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SRC</name>
                <description>LF oscillator source.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>LF oscillator source is unconfigured. Default will be used.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LFXO</name>
                    <description>Use LFXO as source for the LF oscillator.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LFRC</name>
                    <description>Use LFRC as source for the LF oscillator.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Synth</name>
                    <description>Use LF Synth as source for the LF oscillator.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LFXOCONFIG</name>
            <description>LFXO configuration.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACCURACY</name>
                <description>LFXO crystal or external signal accuracy.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The accuracy is unconfigured.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>500ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 500 ppm.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>250ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 250 ppm.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>150ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 150 ppm.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 100 ppm.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>75ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 75 ppm.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 50 ppm.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>30ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 30 ppm.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>20ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 20 ppm.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>LFXO mode. LFXO will not start unless MODE is configured.</description>
                <lsb>4</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The mode is unconfigured.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pierce</name>
                    <description>LFXO Pierce mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXO</name>
                    <description>LFXO PIXO mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExtSine</name>
                    <description>LFXO in external sine wave mode.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExtSquare</name>
                    <description>LFXO in external square wave mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOADCAP</name>
                <description>Built-in load capacitors selection in 1 pF steps. Max. value 25 pF.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The built-in load capacitors is unconfigured. LFXO will not start unless LOADCAP is configured.</description>
                    <value>0xFF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Do not use the built-in load capacitors, only external capacitors will be used.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIME</name>
                <description>LFXO startup time in ms.</description>
                <lsb>16</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Startup time has not been configured.</description>
                    <value>0xFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LFXOCAL</name>
            <description>LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit, load capacitance, or crystal swap.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFXOCAL</name>
                <description>LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit, load capacitance, or crystal swap.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Calibrate</name>
                    <description>Calibrate the LFXO at startup.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LFRCAUTOCALCONFIG</name>
            <description>LFRC autocalibration configuration.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TEMPINTERVAL</name>
                <description>Temperature measurement interval in 0.25 s steps.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TEMPDELTA</name>
                <description>Temperature delta that should trigger a calibration in 0.25 degrees steps.</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>INTERVALMAXNO</name>
                <description>Maximum number of TEMPINTERVAL periods in between calibrations, independent of temperature changes.</description>
                <lsb>16</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>ENABLE</name>
                <description>LFRC.AUTOCALCONFIG register enable.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>LFRC.AUTOCALCONFIG register has been configured and can be used.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>LFRC.AUTOCALCONFIG register has not been configured and cannot be used.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>HFXO</name>
          <description>Unspecified</description>
          <headerStructName>BICR_HFXO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x024</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>HFXO configuration.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <description>HFXO mode.</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The mode is unconfigured.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pierce</name>
                    <description>HFXO Pierce mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXO</name>
                    <description>HFXO PIXO mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExtSquare</name>
                    <description>HFXO in external square wave mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Auto</name>
                    <description>Either Pierce or PIXO automatically handled by the system based on system requests.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOADCAP</name>
                <description>Built-in load capacitors selection in 1 pF steps. Max. value 25 pF.</description>
                <lsb>12</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The built-in load capacitors is unconfigured. HFXO will not start unless LOADCAP is configured.</description>
                    <value>0xFF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Do not use the built-in load capacitors, only external capacitors will be used.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTUPTIME</name>
            <description>HFXO startup time in us.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIME</name>
                <description>HFXO startup time in us.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Startup time has not been configured.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TAMPC</name>
          <description>Unspecified</description>
          <headerStructName>BICR_TAMPC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x034</addressOffset>
          <register>
            <name>TAMPERSWITCH</name>
            <description>Configuration for external tamper switch detector.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TAMPERSWITCH</name>
                <description>Tamper switch enable.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Tamper switch is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Tamper switch is enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ACTIVESHIELD</name>
            <description>Configuration for active shield channels.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHEN_0</name>
                <description>Active shield enable for channel 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 0 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 0 is enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_1</name>
                <description>Active shield enable for channel 1.</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 1 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 1 is enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_2</name>
                <description>Active shield enable for channel 2.</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 2 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 2 is enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_3</name>
                <description>Active shield enable for channel 3.</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 3 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 3 is enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
