lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_FICR_NS</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x0FFFE000</baseAddress>
      <headerStructName>FICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>BLE</name>
          <description>Unspecified</description>
          <headerStructName>FICR_BLE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x00C</addressOffset>
          <register>
            <name>ADDRTYPE</name>
            <description>Device address type.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TYPE</name>
                <description>Device address type.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Public</name>
                    <description>Public address.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Random</name>
                    <description>Random address.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>ADDR[%s]</name>
            <description>Description collection: 48 bit device address.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Device address [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>ER[%s]</name>
            <description>Description collection: Encryption Root.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ER</name>
                <description>Encryption root word [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>IR[%s]</name>
            <description>Description collection: Identity Root.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IR</name>
                <description>Identity root word [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NFC</name>
          <description>Unspecified</description>
          <headerStructName>FICR_NFC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x040</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>TAGHEADER[%s]</name>
            <description>Description collection: Default header for NFC Tag.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF5F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UD0</name>
                <description>Unique identifier byte 0</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD1</name>
                <description>Unique identifier byte 1</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD2</name>
                <description>Unique identifier byte 2</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD3</name>
                <description>Unique identifier byte 3</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x050</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MRAM</name>
            <description>MRAM variant</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MRAM</name>
                <description>MRAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEPAGESIZE</name>
            <description>Code memory page size in bytes</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00001000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CODEPAGESIZE</name>
                <description>Code memory page size in bytes</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODESIZE</name>
            <description>Code memory size</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000100</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CODESIZE</name>
                <description>Code memory size in number of pages</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICETYPE</name>
            <description>Device type</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEVICETYPE</name>
                <description>Device type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is an physical DIE</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is an FPGA</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <cluster>
            <name>GLOBAL</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_GLOBAL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x284</addressOffset>
            <cluster>
              <name>SAADC</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GLOBAL_SAADC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <name>CALVREF</name>
                <description>Trim value for GLOBAL.SAADC.CALVREF</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x3</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CALGAIN[%s]</name>
                <description>Description collection: Trim value for GLOBAL.SAADC.CALGAIN</description>
                <addressOffset>0x4</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>CALOFFSET</name>
                <description>Trim value for GLOBAL.SAADC.CALOFFSET</description>
                <addressOffset>0x10</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x6</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>LINCALCOEFF[%s]</name>
                <description>Description collection: Trim value for GLOBAL.SAADC.LINCALCOEFF</description>
                <addressOffset>0x14</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>CALIREF</name>
                <description>Trim value for GLOBAL.SAADC.CALIREF</description>
                <addressOffset>0x2C</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>CALVREFTC</name>
                <description>Trim value for GLOBAL.SAADC.CALVREFTC</description>
                <addressOffset>0x30</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>NFCT</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GLOBAL_NFCT</headerStructName>
              <access>read-write</access>
              <addressOffset>0x38</addressOffset>
              <register>
                <name>BIASCFG</name>
                <description>Trim value for NFCT.BIASCFG</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>CANPLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GLOBAL_CANPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x3C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_GLOBAL_CANPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for GLOBAL.CANPLL.CTUNE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>COMP</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_GLOBAL_COMP</headerStructName>
              <access>read-write</access>
              <addressOffset>0x4C</addressOffset>
              <register>
                <name>REFTRIM</name>
                <description>Trim value for GLOBAL.COMP.REFTRIM</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RCALTRIM</name>
                <description>Trim value used during production test</description>
                <addressOffset>0x4</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>APPLICATION</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_APPLICATION</headerStructName>
            <access>read-write</access>
            <addressOffset>0x2D8</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_APPLICATION_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_APPLICATION_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for APPLICATION.HSFLL.VSUP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
