lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
        <register>
          <name>GHWCFG2</name>
          <description>User Hardware Configuration 2 Register</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x228BFC72</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OTGMODE</name>
              <description>Mode of Operation (OtgMode). - 3b000:</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HNPSRP</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRPOTG</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NHNPNSRP</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRPCAPD</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONOTGD</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRPCAPH</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONOTGH</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTGARCH</name>
              <description>Architecture (OtgArch)</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVEMODE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNALDMA</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNALDMA</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGPNT</name>
              <description>Point-to-Point (SingPnt)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTIPOINT</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEPOINT</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSPHYTYPE</name>
              <description>High-Speed PHY Interface Type (HSPhyType)</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOHS</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTMIPLUS</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPI</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTMIPUSULPI</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSPHYTYPE</name>
              <description>Full-Speed PHY Interface Type (FSPhyType)</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FS</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FS</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSPLUSUTMI</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSPLUSULPI</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMDEVEPS</name>
              <description>Number of Device Endpoints (NumDevEps)</description>
              <lsb>10</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENDPT0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT1</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT2</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT3</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT4</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT5</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT6</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT7</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT8</name>
                  <description>Unspecified</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT9</name>
                  <description>Unspecified</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT10</name>
                  <description>Unspecified</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT11</name>
                  <description>Unspecified</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT12</name>
                  <description>Unspecified</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT13</name>
                  <description>Unspecified</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT14</name>
                  <description>Unspecified</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT15</name>
                  <description>Unspecified</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMHSTCHNL</name>
              <description>Number of Host Channels (NumHstChnl)</description>
              <lsb>14</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOSTCH0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH1</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH2</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH3</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH4</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH5</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH6</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH7</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH8</name>
                  <description>Unspecified</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH9</name>
                  <description>Unspecified</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH10</name>
                  <description>Unspecified</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH11</name>
                  <description>Unspecified</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH12</name>
                  <description>Unspecified</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH13</name>
                  <description>Unspecified</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH14</name>
                  <description>Unspecified</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCH15</name>
                  <description>Unspecified</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIOSUPPORT</name>
              <description>Periodic OUT Channels Supported in Host Mode (PerioSupport)</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DYNFIFOSIZING</name>
              <description>Dynamic FIFO Sizing Enabled (DynFifoSizing)</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTIPROCINTRPT</name>
              <description>Multi Processor Interrupt Enabled (MultiProcIntrpt)</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPTXQDEPTH</name>
              <description>Non-periodic Request Queue Depth (NPTxQDepth)</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTXQDEPTH</name>
              <description>Host Mode Periodic Request Queue Depth (PTxQDepth)</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUE2</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE4</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE8</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE16</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TKNQDEPTH</name>
              <description>Device Mode IN Token Sequence Learning Queue Depth (TknQDepth)</description>
              <lsb>26</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
