lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
        <register>
          <name>TRCVIIECTLR</name>
          <description>ViewInst exclude control. Might ignore writes when the trace unit is enabled or not idle. This register must be programmed when one or more address comparators are implemented.</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INCLUDE_0</name>
              <description>Include range field. Selects which address range comparator pairs are in use with ViewInst include control.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 0 defines, is not selected for ViewInst include control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 0 defines, is selected for ViewInst include control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCLUDE_1</name>
              <description>Include range field. Selects which address range comparator pairs are in use with ViewInst include control.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 1 defines, is not selected for ViewInst include control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 1 defines, is selected for ViewInst include control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCLUDE_2</name>
              <description>Include range field. Selects which address range comparator pairs are in use with ViewInst include control.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 2 defines, is not selected for ViewInst include control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 2 defines, is selected for ViewInst include control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCLUDE_3</name>
              <description>Include range field. Selects which address range comparator pairs are in use with ViewInst include control.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 3 defines, is not selected for ViewInst include control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 3 defines, is selected for ViewInst include control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCLUDE_4</name>
              <description>Include range field. Selects which address range comparator pairs are in use with ViewInst include control.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 4 defines, is not selected for ViewInst include control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 4 defines, is selected for ViewInst include control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCLUDE_5</name>
              <description>Include range field. Selects which address range comparator pairs are in use with ViewInst include control.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 5 defines, is not selected for ViewInst include control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 5 defines, is selected for ViewInst include control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCLUDE_6</name>
              <description>Include range field. Selects which address range comparator pairs are in use with ViewInst include control.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 6 defines, is not selected for ViewInst include control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 6 defines, is selected for ViewInst include control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCLUDE_7</name>
              <description>Include range field. Selects which address range comparator pairs are in use with ViewInst include control.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 7 defines, is not selected for ViewInst include control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 7 defines, is selected for ViewInst include control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLUDE_0</name>
              <description>Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 0 defines, is not selected for ViewInst exclude control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 0 defines, is selected for ViewInst exclude control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLUDE_1</name>
              <description>Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 1 defines, is not selected for ViewInst exclude control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 1 defines, is selected for ViewInst exclude control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLUDE_2</name>
              <description>Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 2 defines, is not selected for ViewInst exclude control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 2 defines, is selected for ViewInst exclude control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLUDE_3</name>
              <description>Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 3 defines, is not selected for ViewInst exclude control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 3 defines, is selected for ViewInst exclude control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLUDE_4</name>
              <description>Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 4 defines, is not selected for ViewInst exclude control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 4 defines, is selected for ViewInst exclude control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLUDE_5</name>
              <description>Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 5 defines, is not selected for ViewInst exclude control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 5 defines, is selected for ViewInst exclude control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLUDE_6</name>
              <description>Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 6 defines, is not selected for ViewInst exclude control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 6 defines, is selected for ViewInst exclude control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLUDE_7</name>
              <description>Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 7 defines, is not selected for ViewInst exclude control.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair 7 defines, is selected for ViewInst exclude control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
