lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
            <register>
              <name>XIPWRITECTRL</name>
              <description>This Register is valid only when SSIC_XIP_WRITE_REG_EN is equal to 1.</description>
              <addressOffset>0x048</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>WRFRF</name>
                  <description>SPI Frame Format</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>RSVD</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_DUAL</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_QUAD</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_OCTAL</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRTRANSTYPE</name>
                  <description>Address and instruction transfer format.</description>
                  <lsb>2</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TT0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRADDRL</name>
                  <description>This bit defines Length of Address to be transmitted.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ADDR_L0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L12</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L16</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L20</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L24</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L28</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L32</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRINSTL</name>
                  <description>Dual/Quad/Octal mode instruction length in bits.</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INST_L0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L16</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRSPIDDREN</name>
                  <description>SPI DDR Enable bit.</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                </field>
                <field>
                  <name>WRINSTDDREN</name>
                  <description>Instruction DDR Enable bit.</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>XIPWRHYPERBUSEN</name>
                  <description>SPI Hyperbus Frame format enable for XIP Write transfers.</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                </field>
                <field>
                  <name>XIPWRRXDSSIGEN</name>
                  <description>Enable rxds signaling during address and command phase of Hyperbus transfer.</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                </field>
                <field>
                  <name>RSVDXIPWRITECTRL14TO15</name>
                  <description>Reserved bits - Read Only</description>
                  <lsb>14</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPWRWAITCYCLES</name>
                  <description>Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception.</description>
                  <lsb>16</lsb>
                  <msb>20</msb>
                </field>
                <field>
                  <name>RSVDXIPWRITECTRL21TO31</name>
                  <description>Reserved bits - Read Only</description>
                  <lsb>21</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
