lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
          <register>
            <name>DMSTATUS</name>
            <description>Debug Module Status</description>
            <addressOffset>0x44</addressOffset>
            <access>read-only</access>
            <resetValue>0x00400082</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VERSION</name>
                <description>Version of the debug module.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotPresent</name>
                    <description>Debug module not present.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>V011</name>
                    <description>There is a Debug Module and it conforms to version 0.11 of this specifcation.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>V013</name>
                    <description>There is a Debug Module and it conforms to version 0.13 of this specifcation.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonConform</name>
                    <description>There is a Debug Module but it does not conform to any available version of the spec.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONFSTRPTRVALID</name>
                <description>Configuration string.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRelevant</name>
                    <description>The confstrptr0..confstrptr3 holds information which is not relevant to the configuration string.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Address</name>
                    <description>The confstrptr0..confstrptr3 holds the address of the configuration string.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HASRESETHALTREQ</name>
                <description>Halt-on-reset support status.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Halt-on-reset is supported.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Halt-on-reset is not supported.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTHBUSY</name>
                <description>Authentication busy status.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>The authentication module is ready.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>The authentication module is busy.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTHENTICATED</name>
                <description>Authentication status.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Authentication required before using the debug module.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Authentication passed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYHALTED</name>
                <description>Any currently selected harts halted status.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts halted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts halted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLHALTED</name>
                <description>All currently selected harts halted status.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts halted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts halted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYRUNNING</name>
                <description>Any currently selected harts running status.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts running.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts running.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLRUNNING</name>
                <description>All currently selected harts running status.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts running.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts running.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYUNAVAIL</name>
                <description>Any currently selected harts unavailable status.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts unavailable.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts unavailable.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLUNAVAIL</name>
                <description>All currently selected harts unavailable status.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts unavailable.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts unavailable.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYNONEXISTENT</name>
                <description>Any currently selected harts nonexistent status.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts nonexistent.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts nonexistent.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLNONEXISTENT</name>
                <description>All currently selected harts nonexistent status.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts nonexistent.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts nonexistent.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYRESUMEACK</name>
                <description>Any currently selected harts acknowledged last resume request.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts acknowledged last resume request.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts acknowledged last resume request.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLRESUMEACK</name>
                <description>All currently selected harts acknowledged last resume</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts acknowledged last resume request.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts acknowledged last resume request.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYHAVERESET</name>
                <description>Any currently selected harts have been reset and reset is not acknowledged.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts have been reset and reset is not acknowledget.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts have been reset and reset is not acknowledge.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLHAVERESET</name>
                <description>All currently selected harts have been reset and reset is not acknowledge</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts have been reset and reset is not acknowledge.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts have been reset and reset is not acknowledge.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IMPEBREAK</name>
                <description>Implicit ebreak instruction at the non-existent word immediately after the Program Buffer.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>No implicit ebreak instruction.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Implicit ebreak instruction.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>HARTINFO</name>
            <description>Hart Information</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATAADDR</name>
                <description>Data Address</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATASIZE</name>
                <description>Data Size</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATAACCESS</name>
                <description>Data Access</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>The data registers are shadowed in the hart
          by CSRs. Each CSR is DXLEN bits in size, and
          corresponds to a single argument.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>The data registers are shadowed in the hart's
          memory map. Each register takes up 4 bytes in
          the memory map.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NSCRATCH</name>
                <description>Number of dscratch registers</description>
                <lsb>20</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HALTSUM1</name>
            <description>Halt Summary 1</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HALTSUM1</name>
                <description>Halt Summary 1</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HAWINDOWSEL</name>
            <description>Hart Array Window Select</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HAWINDOWSEL</name>
                <description>The high bits of this field may be tied to 0, depending on how large the array mask register is.
          E.g. on a system with 48 harts only bit 0 of this field may actually be writable.</description>
                <lsb>0</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HAWINDOW</name>
            <description>Hart Array Window</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASKDATA</name>
                <description>Mask data.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
