lilihang123/AB162XM_project/modules/hal/nordic/nrfx/mdk/nrf54h20_enga_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE130_NS</name>
      <description>UART with EasyDMA 2</description>
      <baseAddress>0x4F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM130_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 5</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS130_S</name>
      <description>SPI Slave 3</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM130_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS130_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE130_S</name>
      <description>UART with EasyDMA 3</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM131_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 6</description>
      <baseAddress>0x4F9A6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS131_NS</name>
      <description>SPI Slave 4</description>
      <baseAddress>0x4F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM131_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 2</description>
      <baseAddress>0x4F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS131_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 2</description>
      <baseAddress>0x4F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE131_NS</name>
      <description>UART with EasyDMA 4</description>
      <baseAddress>0x4F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM131_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 7</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS131_S</name>
      <description>SPI Slave 5</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM131_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 3</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS131_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 3</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE131_S</name>
      <description>UART with EasyDMA 5</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
